const marry = require('../../models/marry.js');

exports.run = async (client, message) => {
    const marryres = await marry.findOne({ users: message.member.id });
    let m; let
        f;
    if (marryres) {
        m = message.guild.members.cache.get(marryres.users[0]).nickname || message.guild.members.cache.get(marryres.users[0]).user.username;
        f = message.guild.members.cache.get(marryres.users[1]).nickname || message.guild.members.cache.get(marryres.users[1]).user.username;
    } else {
        m = message.guild.members.cache.get('962270937665896478').nickname || message.guild.members.cache.get('962270937665896478').user.username;
        f = message.guild.members.cache.get('953093158554714132').nickname || message.guild.members.cache.get('953093158554714132').user.username;
    }
    const sex = [
        `${m}的舌頭移動到${f}現在還是遮掩著的胸部上部，碰觸到柔嫩的山麓時，她全身像觸電般的跳動了一下，兩支手又再度緊緊遮住自己，頭像是說不要一般的搖動著。`,
        `${m}讓漏出期待與不滿的呻吟聲的${f}好好的焦急一番後，再突然把舌頭用力的滑往她的口腔中。當他們倆的舌頭交纏，恣意的渴求時，他已經知道她全身的力氣都鬆懈了下來。`,
        `${m}無言的把臉靠過去，${f}的唇已經像是等不及一般的輕輕張開了，但是${m}並沒有馬上將他們的唇合而為一，而是用舌尖悄悄的輕觸她的下唇。`,
        `${m}用右手緊緊的抱住想把他推離的${f}，${f}全身一邊一陣一陣的痙攣，一邊發出像悲鳴的聲音，${m}再用左手抓上了另一側的乳房｡向著前端如同絞擠般的動著手指，接著再緩緩的用食指指甲刮著乳首的尖端。`,
        `在激烈的攻擊兩胸之時，${f}的身體痙攣，甜美的悲鳴以驚人的態勢一直上升。至於得意忘形的${m}，則是把口中微硬的突起物，用有點粗暴的方式咬緊， 『揪~』的拉起來，同時用左手的拇指與食指激烈的捻起另一邊的乳首。`,
        `『嗯嗯嗯!!阿，阿，討厭...騙人...』突然，${f}的全身突然一陣僵硬，用環繞在${m}後頭部的兩腕，用力的抱緊他『討厭，討厭討厭，我..明明只有摸胸部而已...!去...了...』`,
        `一直用舌尖突刺,讓柔穴敏感的收縮而感到興奮的${m}，把身體輕輕的往${f}的身上壓去;${m}的陰莖已經膨脹到極限，光是再這樣探索${f}的身體，他就覺得快不行了｡`,
        `${m}用雙手扶住${f}的側腹，稍微的將腰給往前挺進。在這一瞬間感到了非常緊的抵抗力，但很快的，${m}伴隨著突破某種東西的觸感，性器的前端部分就沉入了${f}的內部。『阿…阿..』${f}用力抓緊${m}的雙肩，閉上眼睛，皺起眉頭嬌喘的${f}，她的全身就算在薄青色的黑暗中，也看的出來呈現著潮紅色，閃耀著汗珠的光輝｡`,
        `${f}在床上被${m}羞恥放置play，她只能張開雙腿，不斷呻吟，泛著淚光咬緊牙關，最後被弄得高潮而無力的癱軟。`,
        `${f}在刑具間被${m}強迫穿上裸體圍裙以及貓耳，然後小穴被${m}用力抽插，感到無力之後決定大聲淫叫。`,
        `從耳朵慢慢往下舔吻到頸部，${m}突然用力的吸吮留下了不少痕跡，再往下到了鎖骨，則細細的啃咬，一連串的攻勢使得${f}呼吸越來越急促，順著吻慢慢移動到右邊硬挺的乳頭，他慢慢挪動身體，好讓右手沿著${f}的腹部往下，解開褲子，瞬間連同內褲一起拉下，隨後快速將腳卡在她的大腿之間。`,
        `趁著${f}不注意，${m}突然將兩隻手指插入${f}的穴內快速的抽插，她痛的夾緊${m}的腳，「啊...痛哈...不要...嗯...痛...」${f}不斷的叫著，下方的疼痛超越了先前的快感。${m}沒有停止，反而將另一隻腳也卡進${f}的雙腿間，強行撐開她的腿，好讓自己更方便抽插。`,
        `「不要...嗯啊...不...不要...」${f}的眼淚不斷奪眶而出，拼命的扭動身體試圖阻止${m}繼續。不管${f}怎麼求饒，${m}仍不罷休，停止上半身的動作，一手壓著${f}的肩，另一手持續抽插，抽插的過程帶出了不少淫水，淫水裡還混雜了幾縷血絲。「嗯...哈啊...不要...會...壞...壞掉...嗯啊...」快感漸漸侵襲意識，${f}放棄抵抗，讓${m}放肆的摧殘自己。隨著${m}抽插速度不斷加快，${f}慢慢逼近高潮，高潮前每一次的抽插力道都漸增，她的呻吟也越來越大聲。「不要啊！！！——」最後一次，${m}再加一隻手指用力一插，${f}下腹一緊，噴出了許多的淫水，大部分都濺到${m}臉上。`,
    ];
    // eslint-disable-next-line no-bitwise
    const res = sex[Math.random() * sex.length | 0];
    message.reply({ content: res, allowedMentions: { parse: ['users'] } });
};

exports.conf = {
    aliases: [],
    permLevel: 'User',
    description: '',
};
